#pragma once

#include <map>
#include <string>

enum class 语句类型 {
  常量定义,
  变量定义,
  容量定义,
  属性定义,
  方法定义,
  函数定义,
  类型定义,
  函数调用,
  模板定义,
  模板调用,
  导出模块,
  导入模块,
  直接赋值,
  复合赋值,
  自增赋值,
  自减赋值,
  混合赋值,
  条件语句,
  循环语句,
  跳转语句,
  返回语句,
  继续语句,
  代码子块,
  数据访问,
  索引访问,
  属性访问,
  管道访问,
  方法访问
};

inline const std::map<语句类型, std::string> 语句文本 = {
    {语句类型::常量定义, "常量定义"}, {语句类型::变量定义, "变量定义"},
    {语句类型::容量定义, "容量定义"}, {语句类型::属性定义, "属性定义"},
    {语句类型::方法定义, "方法定义"}, {语句类型::函数定义, "函数定义"},
    {语句类型::函数调用, "函数调用"}, {语句类型::模板定义, "模板定义"},
    {语句类型::模板调用, "模板调用"}, {语句类型::导出模块, "导出模块"},
    {语句类型::导入模块, "导入模块"}, {语句类型::直接赋值, "直接赋值"},
    {语句类型::复合赋值, "复合赋值"}, {语句类型::自增赋值, "自增赋值"},
    {语句类型::自减赋值, "自减赋值"}, {语句类型::混合赋值, "混合赋值"},
    {语句类型::条件语句, "条件语句"}, {语句类型::循环语句, "循环语句"},
    {语句类型::跳转语句, "跳转语句"}, {语句类型::返回语句, "返回语句"},
    {语句类型::继续语句, "继续语句"}, {语句类型::代码子块, "代码子块"},
    {语句类型::数据访问, "数据访问"}, {语句类型::索引访问, "索引访问"},
    {语句类型::属性访问, "属性访问"}, {语句类型::管道访问, "管道访问"},
    {语句类型::方法访问, "方法访问"},
};