#pragma once

#include <map>
#include <string>

#include "语法分析.hpp"

inline const std::map<std::string, 词元类型> 符号字典 = {
    // 半角符号（英文标点）
    {"+", 词元类型::加号},
    {"-", 词元类型::减号},
    {"*", 词元类型::星号},
    {"/", 词元类型::斜杠},
    {"=", 词元类型::等号},
    {"&", 词元类型::和号},
    {"|", 词元类型::竖线},
    {";", 词元类型::分号},
    {",", 词元类型::逗号},
    {".", 词元类型::点号},
    {":", 词元类型::冒号},
    {"!", 词元类型::叹号},
    {"?", 词元类型::问号},
    {"#", 词元类型::井号},
    {"^", 词元类型::脱字符},
    {"~", 词元类型::波浪号},
    {"%", 词元类型::百分号},
    {">", 词元类型::大于号},
    {"<", 词元类型::小于号},
    {"$", 词元类型::美元符},
    {"_", 词元类型::下划线},
    {"(", 词元类型::左圆括号},
    {")", 词元类型::右圆括号},
    {"{", 词元类型::左花括号},
    {"}", 词元类型::右花括号},
    {"[", 词元类型::左方括号},
    {"]", 词元类型::右方括号},
    // 全角符号（中文标点）
    {"：", 词元类型::冒号},
    {"。", 词元类型::句号},
    {"！", 词元类型::叹号},
    {"？", 词元类型::问号},
    {"，", 词元类型::逗号},
    {"；", 词元类型::分号},
};